Autodesk.Revit.DB.ExternalResourceType.op_Inequality(Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceType)
Compares two ExternalResourceType instances.
first: The first ExternalResourceType.
second: The second ExternalResourceType.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.ExternalResourceType.op_Equality(Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceType)
Compares two ExternalResourceType instances.
first: The first ExternalResourceType.
second: The second ExternalResourceType.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.ExternalResourceType.#ctor(System.Guid)
Creates a new ExternalResourceType instance.
guid: The identifier for the ExternalResourceType.

Autodesk.Revit.DB.ExternalResourceType
A type class used to distinguish between different kinds of external resource.
Remarks:
Revit elements can consume multiple types of external resource data, provided by one or more
external servers.  Conversely, external servers can support one, or more than one, type of
external resource.
Since:
2015